Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: True Heroes go ALL IN or nothing See yourself to the TOP!
pt_pt: Com os verdadeiros heróis é TUDO OU NADA Vejo-te no TOPO!

source: Wow, take it easy!
pt_pt: Eh lá, tem calma!

source: Your Hero Wars team
pt_pt: A equipa de Hero Wars

source: • Help Qing Mao and Aurora fight evil forces.
pt_pt: • Ajuda Qing Mao e Aurora a lutar contra as forças do mal.

source: UPGRADE YOUR HERO!
pt_pt: MELHORA O TEU HERÓI!

source: So cute yet dangerous!
pt_pt: Giro mas perigoso!

source: Get new Masquerade Skins for your favorite heroes!
pt_pt: Obtém novos Visuais Mascarados para os teus heróis favoritos!

source: To continue playing you need to sign up
pt_pt: Para continuares a jogar, tens de registar-te

source: We'd truly appreciate it if you provided as many details as possible so that we could help you :) Screenshots would also be very helpful!
pt_pt: Agradecíamos imenso se pudesses fornecer todos os detalhes possíveis, de forma a podermos ajudar :) Algumas capturas de ecrã também seria bom!

source: Thanks in advance!
pt_pt: Agradecemos desde já!

source: The game progress is linked to your Play Market account.
pt_pt: O progresso do jogo está ligado à tua conta do Play Market.

source: Hot and healthy! Beach Season Complete this event’s quests to receive coins and spend them in the special shop! You can get colorful frames and avatars there, as well as nice offers on valuable resources! Sunny Skies Fashion Rufus, Iris, Satori, and Xe'Sha got themselves some comfy new threads to sunbathe in for the summer. You can also give Xe'Sha’s skin that extra upgrade to make her shine brighter than sea spray! And don’t forget your sun hat!
pt_pt: Quente e saudável! Temporada de Praia Conclui as missões deste evento para receber moedas e para as gastar na loja especial! Moda Céus Ensolarados Rufus, Iris, Satori e Xe'Sha arranjaram roupas confortáveis para apanhar banhos de sol no verão. Também podes dar ao visual de Xe'Sha’s uma melhoria adicional que a fará brilhar mais que a maresia! E não te esqueças do teu chapéu!

source: Don’t miss these Stellar Skins for Dominion’s favorite stars!
pt_pt: Não percas os visuais para estas estrelas do Domínio!

source: Ginger’s skin can also be upgraded, increasing her health!
pt_pt: O visual de Ginger pode ser melhorado, aumentando a sua vida!

source: Play Minigames!
pt_pt: Diverte-te com minijogos!

source: Play this mobile idle RPG anytime, anywhere—and if you want even more streamlined gameplay, use the auto battler. If you’re busy but still want adventurous gameplay, the auto battler will help your heroes become legends even with your demanding schedule!
pt_pt: Joga este RPG ocioso para dispositivos móveis a qualquer hora, em qualquer sítio. E se quiseres uma jogabilidade mais aperfeiçoada, usa o auto battler. Se estiveres ocupado, mas ainda assim quiseres uma jogabilidade cheia de aventura. o auto battler irá ajudar os teus heróis a tornarem-se lendas!

source: Black Friday and renewed Chabba are here!
pt_pt: Chegou a Black Friday com um Chabba renovado!

source: This Month's Hero is Maya
pt_pt: A Heroína deste mês é Maya

source: Click the
pt_pt: Clica no botão

source: Complete quests, claim daily rewards, and earn Hero Soul Stones to unleash the gifted mage's full power!
pt_pt: Conclui missões, resgata recompensas diárias e ganha Pedras Anímicas para libertar todo o poder do incrível mago!

source: Abyssal Curse
pt_pt: Maldição Abissal

source: Increase this Way of Honor knight’s combat power!
pt_pt: Mais poder para este cavaleiro do Caminho da Honra

source: A new resource-hunting season has begun!
pt_pt: A nova temporada começou!

source: Participate in game events, earn points, and collect trophies from every level of the Battle Pass!
pt_pt: Participa nos eventos do jogo, ganha pontos e obtém todos os troféus do Passe de Batalha!

source: With the premium version, you’ll also get extra resources and extravagant Grand Prizes: Xe’Sha’s Sea Skin, a Soleil avatar, and even a stylish themed avatar frame!
pt_pt: Na versão premium também recebes recursos extra e prémios extravagantes: um visual marítimo para Xe’Sha, um avatar Soleil e até uma moldura de avatar cheia de estilo!

source: Island Questaway is a mobile game that is only suitable for phones or tablets.
pt_pt: O Island Questaway é um jogo mobile exclusivo para telemóveis e tablets.

source: We do not recommend playing on other types of devices
pt_pt: Não recomendamos que o jogues noutro tipo de dispositivos

source: DANGER
pt_pt: PERIGO

source: Train Heroes
pt_pt: Treina heróis

source: Join the event and earn incredible new Angelic Skins for Lars and Krista!
pt_pt: Junta-te ao evento e ganha incríveis Visuais Angélicos para Lars e Krista!

source: A new Hero is about to arrive in the Dominion - get to know him during the special event! Cascade is a creature of mysterious background, striving to find his place in this world. Only you can help him settle in among the Guardians, take control of his own power, and correct the wrongs caused by his impulsive mistakes. Embark on a summer adventure with the new Hero to get him on your team, along with a plenty of great rewards!
pt_pt: Um novo Herói está quase a chegar ao Domínio. Descobre-o durante o evento especial! O Dilúvio é uma criatura de origem misteriosa, a tentar encontrar o seu lugar neste mundo. Só tu o podes ajudar a estabelecer-se entre os Guardiões, controlar o seu próprio poder e corrigir o mal causado pelos seus erros impulsivos. Embarca numa aventura de verão com o novo Herói para o colocares na tua equipa, assim como várias excelentes recompensas!

source: Ah, fresh meat!
pt_pt: Ah, novato!

source: My bites are waiting!
pt_pt: Já estou a afiar os dentes para ti!

source: To celebrate the Lunar New Year, Dante, Lilith, and Julius have donned exquisite new outfits.
pt_pt: Dante, Lilith e Julius vão celebrar o Ano Novo Lunar com fantásticos novos visuais.

source: Lilith's Skin can be upgraded further—glam it up to increase her power!
pt_pt: O visual de Lilith pode ser melhorado, o que também aumenta o poder dela!

source: And of course, a festive event like this one would be incomplete without a special chest and some amazing offers.
pt_pt: Como não podia deixar de ser, um evento destes nunca estaria completo sem um baú especial e ofertas fantásticas!

source: Complete quests, earn Jade Coins, and celebrate with your favorite characters!
pt_pt: Conclui missões, ganha Moedas de Jade e celebra com as tuas personagens favoritas!

source: - More Skins in Outland Chests and in exchange for Skin Stones!
pt_pt: - Obtém mais visuais nos Baús da Outland e em troca de Pedras de Visuais!

source: Check them out!
pt_pt: Dá uma espreitadela!

source: This Month’s Hero is Galahad!
pt_pt: Galahad é o Herói do mês!

source: Send
pt_pt: Enviar

source: Hero Wars: Ascend Now ⬆️
pt_pt: Hero Wars: Ascende Já ⬆️

source: Spring is coming to an end, but not for us. A big celebration in Hero Wars! Spring Sale The sale you’ve been waiting for so long is just around the corner! Take part in a massive sale and win unique avatars and frames. Skin Sale As Spring nears its end, don’t miss the chance to obtain the Spring Skins you’ve wanted for so long. Ishmael Harder. Better. Faster. Stronger. The hero’s skills have been made more powerful, while his vampirism is at an all-time high. Onward, to new challenges!
pt_pt: A primavera está a acabar, mas não para nós. Há uma grande celebração em Hero Wars! Promoção de Primavera A promoção mais esperada está ao virar da esquina! Participa e ganha novas molduras e avatares. Promoção de Visuais À medida que a Primavera chega ao fim, não percas a oportunidade de obter os Visuais de Primavera que queres. Ishmael Mais forte, mais rápido e mais resistente. O vampirismo torna as habilidades deste herói ainda mais poderosas. Novos desafios esperam por ti!

source: To change your password at Throne-Rush.com, press the button below: Change Password If you had no plans to change your password, just ignore this email.
pt_pt: Para alterares a tua palavra-passe em Throne-Rush.com, prime o botão abaixo: Alterar palavra-passe Caso não pretendas alterar a tua palavra-passe, ignora este e-mail.

source: Got any more questions?
pt_pt: Tens alguma questão?

source: Send us a word at support@thronerush.zendesk.com!
pt_pt: Contacta-nos através do e-mail support@thronerush.zendesk.com!

source: The Throne Rush Team
pt_pt: A equipa de Throne Rush

source: Even magic can't stop the new hero of the month.
pt_pt: Nem a magia consegue travar o herói do mês.

source: Add Cornelius to your team!
pt_pt: Adiciona Cornelius à tua equipa!

source: We regret to inform you that we don't give out the rewards for completing promo quests, you'll have to contact the company providing the quests.
pt_pt: Infelizmente, não oferecemos as recompensas das missões promocionais, por isso, deves contactar a empresa que disponibilizou as missões.

source: Please contact our support team, and we'll help you prepare a request. You can submit it using the following link: http://bit.ly/HWSupportRU
pt_pt: Contacta a nossa equipa de suporte e iremos ajudar-te a preparar um pedido, o qual podes enviar através da ligação seguinte: http://bit.ly/HWSupportRU

source: Friendly Navigation
pt_pt: Navegação amigável

source: The future holds many more breathtaking secrets, oh brave Hero!
pt_pt: O futuro está cheio de segredos incríveis, herói!

source: Follow the news so you don't miss them!
pt_pt: Fica a par de tudo nas notícias!

source: Exit
pt_pt: Saída

source: Hello! You can actually play the whole game for free. It might take a little more time though: e.g. the raid function saves you lots of time. Still, there are many ways to earn free resources: you can get free Energy 3 times a day, visit Theatre or watch Boxy's videos, check the Newsfeed or our official Facebook page. Have a good time in Hero Wars!
pt_pt: Olá! É possível jogar todo o jogo de graça, mas demora um pouco mais: por exemplo, a incursão permite poupar muito tempo. Mas há outras formas de ganhar recursos: podes receber energia gratuitamente 3 vezes por dia: visita o Theatre, vê vídeos do Boxy e consulta o mural de notícias ou a nossa página oficial no Facebook. Diverte-te com o Hero Wars!

source: Privacy policy of the Throne Rush web platform
pt_pt: Política de Privacidade da plataforma da Web do Throne Rush

source: Join your guildmates in a new event and challenge the Archdemon!
pt_pt: Junta-te aos teus aliados da guilda num novo evento e desafia o Grão-Demónio!

source: New things from the coral reefs have drifted ashore!
pt_pt: Deram à costa novos objetos do recife de corais!

source: The mere sight of powerful pincers and twisted tentacles on the Guardians of Dominion will crush your opponents’ morale — strike true!
pt_pt: A moral dos teus adversários vai esmorecer só de ver as tenazes poderosas e os tentáculos torcidos nos Guardiões do Domínio!

source: The Isaac’s new outfit can additionally be upgraded at the store, doubling his might.
pt_pt: O novo fato de Isaac pode ser melhorado na loja, tornando-o duas vezes mais forte.

source: Do your Heroes have what it takes to become real sea-dogs?
pt_pt: Será que os teus Heróis têm o que é preciso para se tornarem verdadeiros marinheiros?

source: Play every day to obtain Maya's Soul Stones!
pt_pt: Joga todos os dias e obtém Pedras Anímicas de Maya

source: Grant unimaginable power to six Heroes at once!
pt_pt: Concede grande poder a seis Heróis ao mesmo tempo!

source: E-mail addresses do not match
pt_pt: Os endereços de e-mail não coincidem

source: Useful resources and unique spring items await!
pt_pt: Aguardam-te recursos úteis e itens de primavera únicos!

source: And the Premium Pass will get you extra rewards and decorations!
pt_pt: E o Passe Premium dar-te-á recompensas e decorações adicionais!

source: Take part in the special Black Friday event, with discounts of up to 55%!
pt_pt: Participa no evento especial de Black Friday e aproveita até 55% de desconto!

source: Don't miss out on our 3-day Greek Skin sale to dress up your favorite Heroes and give Cascade's outfit an extra upgrade!
pt_pt: Não percas a promoção Visual Grego de três dias e veste os teus heróis preferidos! E dá uma melhoria ao fato de Cascade!

source: Old password does not match
pt_pt: A palavra-passe antiga não coincide

source: BEAT THE STORY CAMPAIGN!
pt_pt: CONCLUI A HISTÓRIA DA CAMPANHA!

source: New Sea Skins for Isaac and Julius!
pt_pt: Novos Visuais do Mar para Isaac e Julius!

source: Be a great hero with this February's Battle Pass!
pt_pt: Descobre o Passe de Batalha de fevereiro!

source: Meet the new Guardian!
pt_pt: Descobre o novo Guardião!

source: The long awaited return of Tenebris and Titan Brawls!
pt_pt: Tenebris e as Brigas de Titãs estão de volta!

source: Something New for the New Year! Defenders of the Holiday Someone's going to spoil the fun! Only the Guardians of the Dominion can save the spirit of the Winterfest; help them and get a new powerful ally for your team. New Hero on the Way of Progress Julius is a talented inventor and curious explorer. He is capable of covering his friends with strong shields - as strong as he is cute! Show your claws!
pt_pt: Algo novo para o Ano Novo! Defensores das Festas Alguém vai tentar estragar a festa! Só os Guardiões do Domínio podem salvar o espírito do Festival de Inverno. Ajuda-os e ganha um novo e poderoso aliado para a tua equipa. Novo Herói no Caminho do Progresso Julius é um inventor talentoso e um explorador curioso. é capaz de proteger os seus amigos com escudos tão poderosos como ele é fofo! Mostra as tuas garras!

source: New Guardian in Hero Wars!
pt_pt: Novo Guardião no Hero Wars!

source: It’s the Lunar New Year in Dominion!
pt_pt: É o Ano Novo Lunar no Domínio!

source: Draconic Fortunes Join the holiday event and earn valuable resources, exciting frames and avatars, and upgrades to Lilith’s Lunar Skin!
pt_pt: Fortunas Dracónicas Ganha recursos valiosos, molduras e avatares empolgantes e melhorias do Visual Lunar de Lilith no evento festivo!

source: Hero Classes Hero roles have been replaced by classes, granting characters a special skill that improves their effectiveness.
pt_pt: Classes de Heróis Os papéis dos Heróis foram substituídos por classes, dando às personagens uma habilidade especial que melhora a sua eficácia.

source: Upgrade these skills in the Unity of Forces event!
pt_pt: Melhora estas habilidades no evento Aliança de Forças!

source: Glyph Change You can now use a singular new resource to level up Glyphs of all your Heroes.
pt_pt: Alterar Glifo Agora podes usar um recurso para subir de nível os Glifos de todos os teus heróis.

source: Victory has never been so close at hand!
pt_pt: A vitória nunca esteve tão perto!

source: Reset
pt_pt: Repor

source: Home
pt_pt: Início

source: Send your Titans to battle at the peak of their power and earn valuable rewards!
pt_pt: Usa os teus Titãs na sua força máxima e ganha recompensas fantásticas!

source: The higher your Team Level, the more Gold you'll get!
pt_pt: Quanto maior for o teu Nível de Equipa, mais Ouro receberás!

source: I had a YEAR-LONG raid!!!
pt_pt: Passei UM ANO num raid!

source: Araсhne doesn't need any more proof that her cybertech and her sharp mind are a lethal combo.
pt_pt: Arachne não precisa de mais nada exceto a letal combinação de cibertecnologia e da sua mente ágil.

source: Log into the game this February and claim daily rewards to make the intrepid warrior part of your team and help her grow even stronger!
pt_pt: Inicia sessão neste fevereiro e resgata recompensas diárias para tornar esta intrépida guerreira parte da tua equipa e para a ajudares a ficar ainda mais forte!

source: Get new outfits for your favorite Guardians, take part in the event, and earn rewards to defeat the Archdemon himself!
pt_pt: Obtém novos visuais para os teus Guardiões favoritos, junta-te ao evento e ganha recompensas para vencer o Grão-Demónio!

source: Master of Shadows
pt_pt: Mestre das Sombras

source: In this quest, you need to tap on geysers in a way that they would copy the geysers from the other side of the bridge
pt_pt: Nesta missão, tens de tocar nos géiseres de forma a que imitem os géiseres do outro lado da ponte

source: We're very sorry to hear that :( If you're unable to contact us via the game settings, kindly use this link to reach out to our Support department: bit.ly/IQ_support We'll be waiting your your message!
pt_pt: Lamentamos que isso esteja a acontecer :( Se não conseguires contactar-nos através das definições do jogo, usa este link para contactar o nosso departamento de Suporte: bit.ly/IQ_support Estaremos à espera da tua mensagem!

source: Beacon of Rebirth!
pt_pt: Um farol do Renascimento!

source: Defenders of the Holiday!
pt_pt: Defensores Festivos!

source: Refresh
pt_pt: Atualizar

source: Leprecats have swarmed across the Dominion, and they've got something better than a pot of gold with them!
pt_pt: Os gnomolinos invadiram o Domínio e trazem consigo algo melhor que um pote de ouro!

source: Participate in the special event, collect Leprecats, and win cool rewards!
pt_pt: Participa no evento especial, recolhe gnomolinos e ganha recompensas fantásticas!

source: Learn Soleil’s story and join him on his path to become a hero!
pt_pt: Descobre a história de Soleil e junta-te a ele enquanto se torna um Guardião!

source: See you around the Dominion soon!
pt_pt: Vemo-nos no Dominion!

source: Complete quests, grow your tree, and earn rewards. A taller tree means more prizes for you and your comrades!
pt_pt: Conclui missões, faz crescer a tua árvore e ganha recompensas. Uma árvore mais alta significa mais prémios!

source: All the pain and grief Xe'Sha experienced during her exile to distant worlds has become an endless source of magic power.
pt_pt: Toda a dor e sofrimento pela qual Xe'Sha passou no seu exílio em mundos distantes tornaram-se uma interminável fonte do seu poder mágico.

source: She's been growing stronger by the day and is ready to smite her opponents now!
pt_pt: Ela tornou-se cada vez mais forte e agora está pronta para destruir os seus inimigos!

source: Log into the game this December and claim daily rewards to make Xe'Sha part of your team and upgrade her!
pt_pt: Inicia sessão neste dezembro e resgata recompensas diárias para melhorar e tornar Xe'Sha parte da tua equipa!

source: What a lucky update! New Talismans A whole trove of magical gifts awaits the Guardians! Discover new Talismans for Astaroth, Cornelius, Ishmael, Martha, Maya, and Yasmine: multiply the strength of these Heroes and shatter the enemy’s ranks! Prove your supremacy on the field of battle!
pt_pt: Que atualização auspiciosa! Novos Talismãs Há montes de presentes mágicos à espera dos Guardiões! Descobre os novos Taismãs para Astaroth, Cornelius, Ishmael, Martha, Maya e Yasmine! Aumenta o poder destes heróis e destrói os teus adversários! Mostra o que vales no terreno!

source: Don't miss out on new spring outfits for Orion, K'arkh, and Keira!
pt_pt: Não percas os novos visuais primaveris para Orion, K'arkh e Keira!

source: · Added the 4th level of the quest "Guild Activity" and increased the number of gifts for the first three levels
pt_pt: · Foi adicionado o 4.º nível da missão "Guild Activity" e aumentado o número de prendas dos primeiros três níveis

source: Exciting Worlds
pt_pt: Mundos Impressionantes

source: button
pt_pt: na

source: • Dark Star’s new skin will increase her armor penetration.
pt_pt: • O novo visual de Dark Star vai melhorar a sua penetração de armadura.

source: Chronicle of Dominion!
pt_pt: Crónicas do Domínio!

source: Get as many stars in the Campaign as you can to unlock new Mini Games and earn Maya's Soul Stones!
pt_pt: Obtém o máximo de estrelas na Campanha para desbloquear minijogos e ganhar Pedras de Alma de Maya!

source: Morrigan is a powerful Support Hero who sacrificed everything to resurrect her father before joining the Eternity faction.
pt_pt: Morrigan é uma heroína de apoio que sacrificou tudo para ressuscitar o pai dela, antes de se juntar à fação da eternidade.

source: Log into the game this November and claim daily rewards to make the brave necromancer princess part of your team and upgrade her!
pt_pt: Em novembro, entra no jogo e obtém recompensas diárias, melhora a princesa necromante e usa-a na tua equipa!

source: Go, fight, win!
pt_pt: Prepara-te, luta, vence!

source: Reset your password
pt_pt: Repor a palavra-passe

source: An Oriental Event with Hero Skins and great offers!
pt_pt: Um Evento Oriental com Visuais de Herói e ofertas fantásticas!

source: Hero Wars has engaging gameplay, challenging pathways and a range of heroes to choose from
pt_pt: É um jogo envolvente, com caminhos desafiantes e uma gama de heróis

source: NOT supported: iPhone 5S, 6, 6 Plus; iPad Air, Mini 2, Mini 3, iPod Touch
pt_pt: Dispositivos NÃO suportados: iPhone 5S, 6, 6 Plus; iPad Air, Mini 2, Mini 3, iPod Touch

source: User not found
pt_pt: Utilizador não encontrado

source: Cute and Mischievous
pt_pt: Fofinhos e Marotos

source: LOOT EFFORTLESSLY!
pt_pt: GANHA SAQUE!

source: Summon heroes, titans, and other characters to fight for control over the Dominion in the battle arena.
pt_pt: Invoca heróis, titãs e outras personagens e luta pelo controlo sobre o Domínio na arena de batalha.

source: Join the battle and immortalize your heroes in legends!
pt_pt: Junta-te ao combate e imortaliza os teus heróis como lendas!

source: Coming back is a stroke of good luck around here! Login Gift There’s a special event in the game — just log into your account and claim a reward. Technical Improvements We fixed some minor issues and improved the app’s performance so you’d want to stay in the game for longer. See you in the Dominion!
pt_pt: Entras sempre com o pé direito quando regressas! Presente de Sessão Está a decorrer um evento especial. Inicia sessão para obter uma recompensa. Melhorias técnicas Corrigimos uns pequenos problemas e melhorámos o desempenho da app. Não a vais querer largar nem um segundo! Vemo-nos no Domínio!

source: Don’t miss an opportunity to get a fresh outfit for Keira, Maya, and Peppy and make them stronger!
pt_pt: Não percas a oportunidade de obter novos visuais para Keira, Maya e Peppy! Torna-as mais fortes!

source: ● Exciting Special Events
pt_pt: ● Eventos especiais empolgantes

source: Crush your opponents this February!
pt_pt: Este fevereiro, mostra quem manda!

source: It's a great chance to stock up on resources and spruce up your profile with a special avatar and an eye-catching frame.
pt_pt: Vais poder ganhar recursos e abrilhantar o teu perfil com um avatar especial e uma moldura vistosa.

source: Pave your way to becoming a real hero and make your foes tremble in fear!
pt_pt: Mostra o teu lado heroico e aterroriza os teus inimigos!

source: Sign in via
pt_pt: Iniciar sessão via

source: We’re working hard on the new update, and it’s coming sometime soon :) Stay with us to be the first to know about the release!
pt_pt: Estamos a trabalhar arduamente na nova atualização e vai ser lançada em breve :) Toma atenção às novidades e serás o primeiro a saber do seu lançamento!

source: There are dark times ahead—meet the new Titan!
pt_pt: Aproximam-se tempos sombrios. Conhece o novo Titã!

source: This update comes bearing light!
pt_pt: Chegou uma nova atualização luminosa!

source: New Titan Welcome Iyari, the Beacon of Rebirth!
pt_pt: Novo Titã Bem-vinda Iyari, Farol do Renascimento!

source: This dignified healer is always ready to support Titans, especially if they’re Light.
pt_pt: Esta curandeira digna está sempre pronta para apoiar Titãs, especialmente se forem de Luz.
